In [1]:
%pwd

'C:\\Users\\Zishi\\Python learning notebooks\\Pydata'

In [2]:
!type C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
import pandas as pd
df = pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex1.csv')

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex1.csv',sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [6]:
!type C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [7]:
pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex2.csv',header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex2.csv',names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
names = ['a','b','c','d','message']
pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex2.csv',names=names,index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [10]:
!type C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [11]:
parsed = pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\csv_mindex.csv',
                    index_col=['key1','key2'])

In [12]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [13]:
list(open(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [14]:
result = pd.read_table(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex3.txt',sep='\s+') #accept regex

In [15]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [16]:
!type C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [17]:
pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex4.csv',skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
!type C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [19]:
result = pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex5.csv',
                    na_values=['NULL'])

In [20]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [21]:
result.isnull()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [22]:
sentinels = {'message':['foo','NA'],'something':['two']}

In [23]:
pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex5.csv',na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [24]:
result = pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex6.csv')
result.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 5 columns):
one      10000 non-null float64
two      10000 non-null float64
three    10000 non-null float64
four     10000 non-null float64
key      10000 non-null object
dtypes: float64(4), object(1)
memory usage: 390.7+ KB

In [25]:
pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex6.csv',nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [26]:
chunker = pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex6.csv',chunksize=1000)

In [27]:
chunker

In [28]:
tot = pd.Series([])
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(),fill_value=0)
tot = tot.sort_values(ascending=False)

In [29]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [30]:
data = pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex5.csv')

In [31]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [32]:
data.to_csv('out.csv')

In [33]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [34]:
data.to_csv('out.csv',na_rep='NULL')

In [35]:
!type out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [36]:
data.to_csv('out.csv',index=False,columns=['a','b','c'])

In [37]:
!type out.csv

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [38]:
dates = pd.date_range('1/1/2017',periods=7)

In [39]:
import numpy as np
ts= pd.Series(np.arange(7),index=dates)

In [40]:
ts

2017-01-01    0
2017-01-02    1
2017-01-03    2
2017-01-04    3
2017-01-05    4
2017-01-06    5
2017-01-07    6
Freq: D, dtype: int32

In [41]:
ts.to_csv('tseries.csv')

In [42]:
!type tseries.csv

2017-01-01,0
2017-01-02,1
2017-01-03,2
2017-01-04,3
2017-01-05,4
2017-01-06,5
2017-01-07,6

In [43]:
pd.Series.from_csv('tseries.csv',parse_dates=True)

2017-01-01    0
2017-01-02    1
2017-01-03    2
2017-01-04    3
2017-01-05    4
2017-01-06    5
2017-01-07    6
dtype: int64

In [44]:
!type C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex7.csv

"a","b","c"
"1","2","3"
"1","2","3","4"

In [45]:
import csv
f = open(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex7.csv')
reader = csv.reader(f)

In [46]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3', '4']

In [47]:
lines = list(csv.reader(open(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex7.csv')))

In [48]:
header,values = lines[0],lines[1:]

In [49]:
data_dict = {h:v for h,v in zip(header,zip(*values))}

In [50]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

JSON

In [51]:
obj = """
{"name":"Wes",
"places_lived":["United States","Spain","Germany"],
"pet":null,
"siblings": [{"name":"Scott","age":25,"pet":"Zuko"},
            {"name":"Katie","age":33,"pet":"Cisco"}]
}
"""

In [52]:
import json

In [53]:
result = json.loads(obj)

In [54]:
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 25, 'name': 'Scott', 'pet': 'Zuko'},
  {'age': 33, 'name': 'Katie', 'pet': 'Cisco'}]}

In [55]:
asjson = json.dumps(result)

In [56]:
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 25, "pet": "Zuko"}, {"name": "Katie", "age": 33, "pet": "Cisco"}]}'

In [57]:
siblings = pd.DataFrame(result["siblings"],columns=["name","age","pet"])

In [58]:
siblings

    name  age    pet
0  Scott   25   Zuko
1  Katie   33  Cisco

XML

In [59]:
from lxml.html import parse
from urllib.request import urlopen

parsed = parse(urlopen('https://finance.yahoo.com/quote/AAPL?p=AAPL'))
doc = parsed.getroot()

In [60]:
links = doc.findall('.//a')

In [61]:
link =links[28]

In [62]:
link.get('href')

'/quote/NFLX?p=NFLX'

In [63]:
for link in links:
    print(link.get('href'))

https://www.yahoo.com/
https://mail.yahoo.com/?.intl=us&.lang=en-US
https://www.flickr.com/
https://www.tumblr.com/
https://www.yahoo.com/news/
http://sports.yahoo.com/
http://finance.yahoo.com/
https://www.yahoo.com/celebrity/
https://answers.yahoo.com/
https://groups.yahoo.com/
https://mobile.yahoo.com/
https://everything.yahoo.com/
https://finance.yahoo.com/
https://mail.yahoo.com/?.intl=us&.lang=en-US&.partner=none&.src=finance
/
/personal-finance
/tech
/industries
/screener
/portfolios?bypass=true
/chart/^GSPC
/quote/^GSPC?p=^GSPC
/chart/^DJI
/quote/^DJI?p=^DJI
https://itunes.apple.com/us/podcast/yahoo-finance-presents/id1241417570?mt=2
/quote/GOOG?p=GOOG
/quote/FB?p=FB
/quote/AMZN?p=AMZN
/quote/NFLX?p=NFLX
/quote/TSLA?p=TSLA
/quote/AAPL?p=AAPL
/quote/AAPL/community?p=AAPL
/quote/AAPL/key-statistics?p=AAPL
/quote/AAPL/profile?p=AAPL
/quote/AAPL/financials?p=AAPL
/quote/AAPL/options?p=AAPL
/quote/AAPL/holders?p=AAPL
/quote/AAPL/history?p=AAPL
/quote/AAPL/analysts?p=AAPL
/chart/AAPL
/quote/AAPL/news?p=AAPL
/quote/AAPL/press-releases?p=AAPL
/m/b9e3b8c3-ff21-3a43-a577-671733d72436/apple%2C-amazon%2C-google-spent.html
/m/b9e3b8c3-ff21-3a43-a577-671733d72436/apple%2C-amazon%2C-google-spent.html
/m/f23fe35e-d2bf-37dd-9db6-3d736eea8f5f/microsoft-gets-rebooted-under.html
/m/f23fe35e-d2bf-37dd-9db6-3d736eea8f5f/microsoft-gets-rebooted-under.html
/news/tech-stocks-briefing-com-030028450.html
/news/tech-stocks-briefing-com-030028450.html
https://itunes.apple.com/us/podcast/yahoo-finance-presents/id1241417570?mt=2
https://smallbusiness.yahoo.com
https://help.yahoo.com/kb/index?page=content&y=PROD_FIN_DESK&locale=en_US&id=SLN2310
http://help.yahoo.com/l/us/yahoo/finance/
https://yahoo.uservoice.com/forums/382977
http://info.yahoo.com/privacy/us/yahoo/
http://info.yahoo.com/relevantads/
http://info.yahoo.com/legal/us/yahoo/utos/utos-173.html
https://twitter.com/YahooFinance
https://facebook.com/yahoofinance
http://yahoofinance.tumblr.com

In [64]:
urls =[link.get('href') for link in doc.findall('.//a')]

In [65]:
urls

['https://www.yahoo.com/',
 'https://mail.yahoo.com/?.intl=us&.lang=en-US',
 'https://www.flickr.com/',
 'https://www.tumblr.com/',
 'https://www.yahoo.com/news/',
 'http://sports.yahoo.com/',
 'http://finance.yahoo.com/',
 'https://www.yahoo.com/celebrity/',
 'https://answers.yahoo.com/',
 'https://groups.yahoo.com/',
 'https://mobile.yahoo.com/',
 'https://everything.yahoo.com/',
 'https://finance.yahoo.com/',
 'https://mail.yahoo.com/?.intl=us&.lang=en-US&.partner=none&.src=finance',
 '/',
 '/personal-finance',
 '/tech',
 '/industries',
 '/screener',
 '/portfolios?bypass=true',
 '/chart/^GSPC',
 '/quote/^GSPC?p=^GSPC',
 '/chart/^DJI',
 '/quote/^DJI?p=^DJI',
 'https://itunes.apple.com/us/podcast/yahoo-finance-presents/id1241417570?mt=2',
 '/quote/GOOG?p=GOOG',
 '/quote/FB?p=FB',
 '/quote/AMZN?p=AMZN',
 '/quote/NFLX?p=NFLX',
 '/quote/TSLA?p=TSLA',
 '/quote/AAPL?p=AAPL',
 '/quote/AAPL/community?p=AAPL',
 '/quote/AAPL/key-statistics?p=AAPL',
 '/quote/AAPL/profile?p=AAPL',
 '/quote/AAPL/financials?p=AAPL',
 '/quote/AAPL/options?p=AAPL',
 '/quote/AAPL/holders?p=AAPL',
 '/quote/AAPL/history?p=AAPL',
 '/quote/AAPL/analysts?p=AAPL',
 '/chart/AAPL',
 '/quote/AAPL/news?p=AAPL',
 '/quote/AAPL/press-releases?p=AAPL',
 '/m/b9e3b8c3-ff21-3a43-a577-671733d72436/apple%2C-amazon%2C-google-spent.html',
 '/m/b9e3b8c3-ff21-3a43-a577-671733d72436/apple%2C-amazon%2C-google-spent.html',
 '/m/f23fe35e-d2bf-37dd-9db6-3d736eea8f5f/microsoft-gets-rebooted-under.html',
 '/m/f23fe35e-d2bf-37dd-9db6-3d736eea8f5f/microsoft-gets-rebooted-under.html',
 '/news/tech-stocks-briefing-com-030028450.html',
 '/news/tech-stocks-briefing-com-030028450.html',
 'https://itunes.apple.com/us/podcast/yahoo-finance-presents/id1241417570?mt=2',
 'https://smallbusiness.yahoo.com',
 'https://help.yahoo.com/kb/index?page=content&y=PROD_FIN_DESK&locale=en_US&id=SLN2310',
 'http://help.yahoo.com/l/us/yahoo/finance/',
 'https://yahoo.uservoice.com/forums/382977',
 'http://info.yahoo.com/privacy/us/yahoo/',
 'http://info.yahoo.com/relevantads/',
 'http://info.yahoo.com/legal/us/yahoo/utos/utos-173.html',
 'https://twitter.com/YahooFinance',
 'https://facebook.com/yahoofinance',
 'http://yahoofinance.tumblr.com']

In [66]:
tables = doc.findall('.//table')

In [67]:
tables

[<Element table at 0x195b2940b88>,
 <Element table at 0x195b2940d68>,
 <Element table at 0x195b2940cc8>]

In [68]:
from lxml import objectify
path = r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\mta_perf\Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [69]:
data=[]
skip_fields=["PARENT_SEQ","INDICATOR_SEQ","DESIRED_CHANGE","DECIMAL_PLACES"]
for elt in root.INDICATOR:
    el_data={}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag]=child.pyval
    data.append(el_data)

In [74]:
perf = pd.DataFrame(data)
perf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 648 entries, 0 to 647
Data columns (total 12 columns):
AGENCY_NAME       648 non-null object
CATEGORY          648 non-null object
DESCRIPTION       648 non-null object
FREQUENCY         648 non-null object
INDICATOR_NAME    648 non-null object
INDICATOR_UNIT    648 non-null object
MONTHLY_ACTUAL    648 non-null object
MONTHLY_TARGET    648 non-null object
PERIOD_MONTH      648 non-null int64
PERIOD_YEAR       648 non-null int64
YTD_ACTUAL        648 non-null object
YTD_TARGET        648 non-null object
dtypes: int64(2), object(10)
memory usage: 60.8+ KB

In [71]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [72]:
root.get('href')

'http://www.google.com'

In [73]:
root.text

'Google'

In [75]:
frame = pd.read_csv(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [77]:
frame.to_pickle(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\frame_pickle')

In [79]:
pd.read_pickle(r'C:\Users\Zishi\Documents\GitHub\pydata-book\ch06\frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [80]:
import requests

In [82]:
url = 'https://api.twitter.com/1.1/search/tweets.json?q=python%20pandas'
resp = requests.get(url)
resp

In [83]:
import sqlite3

In [85]:
query = """
CREATE TABLE test
(a VARCHAR(20),b VARCHAR(20),
c REAL, d INTEGER);
"""
con = sqlite3.connect(':memory:')
con.execute(query)
con.commit()

In [91]:
data = [('Atlanta','Georgia',1.25,6),
        ('Tallahassee','Florida',2.6,3),
        ('Sacramento','California',1.7,5)]
stmt = "INSERT INTO test VALUES (?,?,?,?)"
con.executemany(stmt,data)
con.commit()

In [93]:
cursor = con.execute("select * from test")
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [94]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [98]:
pd.DataFrame(rows,columns=list(zip(*cursor.description))[0])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [100]:
import pandas.io.sql as sql
sql.read_sql('select * from test',con)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5